const d4Data = {
  id: "dimension4",
  name: "البُعد الرابع: المهارات الحركية",
  domains: [
    {
      code: "Y",
      name: "المهارات الحركية الكبرى",
      goals: [
        {
          code: "Y1",
          name: "السير لأمام بخطوات مناسبة",
          goalText: "سيتمكن الطفل من السير لأمام بخطوات مناسبة.",
          criteria: [
            { score: 1, label: "لم يتقن" },
            { score: 0, label: "لا." }
          ]
        },
        {
          code: "Y2",
          name: "الركوع",
          goalText: "سيتمكن الطفل من المشاركة في وضع الركوع والخروج منه.",
          criteria: [
            { score: 1, label: "لم يتقن" },
            { score: 0, label: "لا." }
          ]
        },
        {
          code: "Y3",
          name: "العدو برفق",
          goalText: "سيتمكن الطفل من العدو برفق.",
          criteria: [
            { score: 1, label: "لم يتقن" },
            { score: 0, label: "لا." }
          ]
        },
        {
          code: "Y4",
          name: "التدحرج جانبا",
          goalText: "سيتمكن الطفل من التدحرج جانباً.",
          criteria: [
            { score: 1, label: "لم يتقن" },
            { score: 0, label: "لا." }
          ]
        },
        {
          code: "Y5",
          name: "القفز للأمام",
          goalText: "سيتمكن الطفل من القفز لأمام مستخدماً كلتا قدميه.",
          criteria: [
            { score: 1, label: "لم يتقن" },
            { score: 0, label: "لا." }
          ]
        },
        {
          code: "Y6",
          name: "القفز لأسفل",
          goalText: "سيتمكن الطفل من القفز لأسفل من على شيء ما.",
          criteria: [
            { score: 1, label: "لم يتقن" },
            { score: 0, label: "لا." }
          ]
        },
        {
          code: "Y7",
          name: "السير للخلف",
          goalText: "سيتمكن الطفل من السير للخلف.",
          criteria: [
            { score: 1, label: "لم يتقن" },
            { score: 0, label: "لا." }
          ]
        },
        {
          code: "Y8",
          name: "النط على القدمين",
          goalText: "سيتمكن الطفل من النط على كلتا قدميه.",
          criteria: [
            { score: 1, label: "لم يتقن" },
            { score: 0, label: "لا." }
          ]
        },
        {
          code: "Y9",
          name: "قذف الكرة من الصدر أو بيديه لأعلى",
          goalText: "سيتمكن الطفل من قذف كرة قطرها (20 سم) من الصدر أو بيديه لأعلى لشخص ما على بعد (120 سم).",
          criteria: [
            { score: 1, label: "لم يتقن" },
            { score: 0, label: "لا." }
          ]
        },
        {
          code: "Y10",
          name: "دحرجة الكرة",
          goalText: "سيتمكن الطفل من دحرجة الكرة لشخص آخر على بعد (180 سم).",
          criteria: [
            { score: 1, label: "لم يتقن" },
            { score: 0, label: "لا." }
          ]
        },
        {
          code: "Y11",
          name: "صعود السلم مستخدماً حركة تبادلية",
          goalText: "سيتمكن الطفل من صعود السلم ارتفاع (1.5 متر) مستخدماً حركة تبادلية.",
          criteria: [
            { score: 1, label: "لم يتقن" },
            { score: 0, label: "لا." }
          ]
        },
        {
          code: "Y12",
          name: "الزحف على المعدة",
          goalText: "سيتمكن الطفل من الزحف على معدته على الأقل لمسافة (90 سم).",
          criteria: [
            { score: 1, label: "لم يتقن" },
            { score: 0, label: "لا." }
          ]
        },
        {
          code: "Y13",
          name: "جلوس القرفصاء",
          goalText: "سيتمكن الطفل من جلوس القرفصاء، والخروج من هذا الوضع.",
          criteria: [
            { score: 1, label: "لم يتقن" },
            { score: 0, label: "لا." }
          ]
        },
        {
          code: "Y14",
          name: "السير فوق عارضة توازن",
          goalText: "سيتمكن الطفل من السير فوق عارضة توازن أو لوح أخر ضيق مسافة (240 سم) دون السقوط.",
          criteria: [
            { score: 1, label: "لم يتقن" },
            { score: 0, label: "لا." }
          ]
        },
        {
          code: "Y15",
          name: "إمساك الكرة بأي طريقة",
          goalText: "سيتمكن الطفل من الإمساك بكرة قطرها (20 سم) تقذف من مسافة (120 سم) بما في ذلك إمساك الكرة بين الصدر والذراعين.",
          criteria: [
            { score: 1, label: "لم يتقن" },
            { score: 0, label: "لا." }
          ]
        },
        {
          code: "Y16",
          name: "ركوب دراجة ذات ثلاث إطارات",
          goalText: "سيتمكن الطفل من ركوب الدراجة ذات ثلاث إطارات لمسافة (6 أمتار) على الأقل.",
          criteria: [
            { score: 1, label: "لم يتقن" },
            { score: 0, label: "لا." }
          ]
        },
        {
          code: "Y17",
          name: "السير جنباً",
          goalText: "سيتمكن الطفل من السير جانباً.",
          criteria: [
            { score: 1, label: "لم يتقن" },
            { score: 0, label: "لا." }
          ]
        },
        {
          code: "Y18",
          name: "الحجل",
          goalText: "سيتمكن الطفل من الحجل (القفز على رجل واحدة).",
          criteria: [
            { score: 1, label: "لم يتقن" },
            { score: 0, label: "لا." }
          ]
        },
        {
          code: "Y19",
          name: "الاتزان على قدم واحدة",
          goalText: "سيتمكن الطفل من الحفاظ على توازنه على قدم واحدة لمدة (3) ثواني على الأقل.",
          criteria: [
            { score: 1, label: "لم يتقن" },
            { score: 0, label: "لا." }
          ]
        },
        {
          code: "Y20",
          name: "ركل الكرة نحو الهدف",
          goalText: "سيتمكن الطفل من ركل كرة قطرها (30 سم) لشخص آخر أو لهدف على بعد (180 سم) على الأقل.",
          criteria: [
            { score: 1, label: "لم يتقن" },
            { score: 0, label: "لا." }
          ]
        },
        {
          code: "Y21",
          name: "التعلق على عقلة",
          goalText: "سيتمكن الطفل من التحكم في وزنه المعلق عند استخدام العقلة.",
          criteria: [
            { score: 1, label: "لم يتقن" },
            { score: 0, label: "لا." }
          ]
        },
        {
          code: "Y22",
          name: "إمساك الكرة باليدين",
          goalText: "سيتمكن الطفل من الإمساك بكرة قطرها (20 سم) بواسطة اليدين فقط (على ألا يمسكها بين الصدر والذراعين) حينما تقذف من مسافة (160 سم).",
          criteria: [
            { score: 1, label: "لم يتقن" },
            { score: 0, label: "لا." }
          ]
        },
        {
          code: "Y23",
          name: "قذف الكرة بيديه لأسفل",
          goalText: "سيتمكن الطفل من قذف كرة قطرها (20 سم) من الصدر أو بيديه لأسفل لشخص ما على بعد (120 سم).",
          criteria: [
            { score: 1, label: "لم يتقن" },
            { score: 0, label: "لا." }
          ]
        },
        {
          code: "Y24",
          name: "قذف والتقاط الكرة",
          goalText: "أن يقذف الطفل الكرة في الهواء ويلتقطها بيده دون أن تسقط على الأرض.",
          criteria: [
            { score: 1, label: "لم يتقن" },
            { score: 0, label: "لا." }
          ]
        },
        {
          code: "Y25",
          name: "تنطيط الكرة",
          goalText: "سيتمكن الطفل من تنطيط الكرة   الكرة على الاقل 3 مرات.",
          criteria: [
            { score: 1, label: "لم يتقن" },
            { score: 0, label: "لا." }
          ]
        },
        {
          code: "Y26",
          name: "ركل كرة متحركة",
          goalText: "ان يركل الطفل كرة تتحرك ببطىء في اتجاه محدد",
          criteria: [
            { score: 1, label: "لم يتقن" },
            { score: 0, label: "لا." }
          ]
        },
        {
          code: "Y27",
          name: "الاهتزاز اثناء التدحرج",
          goalText: "سيتمكن الطفل من تحريك ساقيه اثناء التدحرج.",
          criteria: [
            { score: 1, label: "لم يتقن" },
            { score: 0, label: "لا." }
          ]
        },
        {
          code: "Y28",
          name: "القفز بخفة",
          goalText: "سيتمكن الطفل من الوثب بخفة.",
          criteria: [
            { score: 1, label: "لم يتقن" },
            { score: 0, label: "لا." }
          ]
        },
        {
          code: "Y29",
          name: "القفز من فوق رافعة",
          goalText: "سيتمكن الطفل من القفز من فوق رافعة.",
          criteria: [
            { score: 1, label: "لم يتقن" },
            { score: 0, label: "لا." }
          ]
        },
        {
          code: "Y30",
          name: "ركوب دراجة",
          goalText: "سيتمكن الطفل من ركوب دراجة وايقافها.",
          criteria: [
            { score: 1, label: "لم يتقن" },
            { score: 0, label: "لا." }
          ]
        }
      ]
    },
    {
      code: "Z",
      name: "المهارات الحركية الصغرى",
      goals: [
        {
          code: "Z1",
          name: "وضع علامة (الشخبطة) على الورق باستخدام قلم",
          goalText: "سيتمكن الطفل من الإمساك بقلم التلوين وعمل علامات أو خطوط على الورقة.",
          criteria: [
            { score: 1, label: "لم يتقن" },
            { score: 0, label: "لا." }
          ]
        },
        {
          code: "Z2",
          name: "وضع الاشياء في صندوق خشبي له فتحات مختلفة الشكل",
          goalText: "سيتمكن الطفل من وضع الأشكال المجسمة في الفتحات المناسبة لها بصندوق الأشكال.",
          criteria: [
            { score: 1, label: "لم يتقن" },
            { score: 0, label: "لا." }
          ]
        },
        {
          code: "Z3",
          name: "تركيب بازل من قطعة واحدة",
          goalText: "سيتمكن الطفل من وضع قطع البازل ذات القطعة الواحدة داخل الإطار المخصص لها.",
          criteria: [
            { score: 1, label: "لم يتقن" },
            { score: 0, label: "لا." }
          ]
        },
        {
          code: "Z4",
          name: " بازل بقطع متعددة في إطار",
          goalText: "سيتمكن الطفل من التحكم في وضع قطع البازل المتعددة القطع داخل الاطار الخاص بها.",
          criteria: [
            { score: 1, label: "لم يتقن" },
            { score: 0, label: "لا." }
          ]
        },
        {
          code: "Z5",
          name: "وضع المكعبات على كرت تصميم",
          goalText: "سيتمكن الطفل من وضع المكعبات بدقة في مكانها الصحيح على كرت التصميم.",
          criteria: [
            { score: 1, label: "لم يتقن" },
            { score: 0, label: "لا." }
          ]
        },
        {
          code: "Z6",
          name: "نقل الأشياء من يد إلى اليد الأخرى",
          goalText: "سيتمكن الطفل من نقل الاشياء من يد لليد الأخرى.",
          criteria: [
            { score: 1, label: "لم يتقن" },
            { score: 0, label: "لا." }
          ]
        },
        {
          code: "Z7",
          name: "وضع أعمدة في أماكنها.",
          goalText: "سيتمكن الطفل من وضع أعمدة(أوتاد) في اماكنها المحددة.",
          criteria: [
            { score: 1, label: "لم يتقن" },
            { score: 0, label: "لا." }
          ]
        },
        {
          code: "Z8",
          name: "تقليب صفحات الكتاب",
          goalText: "سيتمكن الطفل من تقليب صفحة من الكتاب كل صفحة على حدة.",
          criteria: [
            { score: 1, label: "لم يتقن" },
            { score: 0, label: "لا." }
          ]
        },
        {
          code: "Z9",
          name: "وضع مشابك على حبل غسيل",
          goalText: "سيتمكن الطفل من وضع مشابك على حبل غسيل.",
          criteria: [
            { score: 1, label: "لم يتقن" },
            { score: 0, label: "لا." }
          ]
        },
        {
          code: "Z10",
          name: "التلوين داخل إطار",
          goalText: "سيتمكن الطفل من تلوين الأشكال داخل الخطوط والحدود المحددة دون الخروج عنها.",
          criteria: [
            { score: 1, label: "لم يتقن" },
            { score: 0, label: "لا." }
          ]
        },
        {
          code: "Z11",
          name: "فتح الحقائب ذات السوسته",
          goalText: "سيتمكن الطفل من فتح الحقائب ذات السوسته.",
          criteria: [
            { score: 1, label: "لم يتقن" },
            { score: 0, label: "لا." }
          ]
        },
        {
          code: "Z12",
          name: "قص ورق بالمقص",
          goalText: "سيتمكن الطفل من قص الورق بالمقص.",
          criteria: [
            { score: 1, label: "لم يتقن" },
            { score: 0, label: "لا." }
          ]
        },
        {
          code: "Z13",
          name: "بناء برج من المكعبات",
          goalText: "سيتمكن الطفل من بناء برج من المكعبات.",
          criteria: [
            { score: 1, label: "لم يتقن" },
            { score: 0, label: "لا." }
          ]
        },
        {
          code: "Z14",
          name: "لضم الخرز",
          goalText: "سيتمكن الطفل من لضم حبات الخرز ذات ثقب(3مم).",
          criteria: [
            { score: 1, label: "لم يتقن" },
            { score: 0, label: "لا." }
          ]
        },
        {
          code: "Z15",
          name: "فتح غطاء علبة",
          goalText: "سيتمكن الطفل من فتح غطاء العلبة.",
          criteria: [
            { score: 1, label: "لم يتقن" },
            { score: 0, label: "لا." }
          ]
        },
        {
          code: "Z16",
          name: "قص ورق بالمقص",
          goalText: "سيتمكن الطفل من قص ورق بالمقص.",
          criteria: [
            { score: 1, label: "لم يتقن" },
            { score: 0, label: "لا." }
          ]
        },
        {
          code: "Z17",
          name: "متابعة الخطوط بالاصبع",
          goalText: "سيتمكن الطفل من متابعة الخطوط بالاصبع.",
          criteria: [
            { score: 1, label: "لم يتقن" },
            { score: 0, label: "لا." }
          ]
        },
        {
          code: "Z18",
          name: "الضغط على زجاجة لاخراج سائل",
          goalText: "سيتمكن الطفل من الضغط على زجاجة لاخراج سائل.",
          criteria: [
            { score: 1, label: "لم يتقن" },
            { score: 0, label: "لا." }
          ]
        },
        {
          code: "Z19",
          name: "ازالة ورق التغليف",
          goalText: "سيتمكن الطفل من ازالة ورق التغليف للحصول على مواد غذائية.",
          criteria: [
            { score: 1, label: "لم يتقن" },
            { score: 0, label: "لا." }
          ]
        },
        {
          code: "Z20",
          name: "نقل الأشكال والانماط إلي حد ما",
          goalText: "سيتمكن الطفل من نقل الاشكال البسيطة والانماط الخطية إلي حد ما.",
          criteria: [
            { score: 1, label: "لم يتقن" },
            { score: 0, label: "لا." }
          ]
        },
        {
          code: "Z21",
          name: "لصق أشكال على حدود صورة ذات حدود عريضة",
          goalText: "سيتمكن الطفل من لصق أشكال مقصوصة من الورق في المكان المناسب في أوضاع مناسبة على صورة ذات حدود عريضة وذلك لجعل الصورة تطابق نموذج مشروع فنى مثلا صنع وجه مهرج.",
          criteria: [
            { score: 1, label: "لم يتقن" },
            { score: 0, label: "لا." }
          ]
        },
        {
          code: "Z22",
          name: "لصق أشكال على حدود صورة ذات حدود رفيعة",
          goalText: "سيتمكن الطفل من لصق أشكال مقصوصة من الورق في المكان المناسب في أوضاع مناسبة على صورة ذات حدود رفيعة وذلك لجعل الصورة تطابق نموذج مشروع فنى مثلا صنع وجه مهرج.",
          criteria: [
            { score: 1, label: "لم يتقن" },
            { score: 0, label: "لا." }
          ]
        },
        {
          code: "Z23",
          name: "حلقات في أوتاد",
          goalText: "أن يضع الطفل حلقات في أوتاد.",
          criteria: [
            { score: 1, label: "لم يتقن" },
            { score: 0, label: "لا." }
          ]
        },
        {
          code: "Z24",
          name: "غلق غطاء علبة",
          goalText: "سيتمكن الطفل من غلق غطاء علبة.",
          criteria: [
            { score: 1, label: "لم يتقن" },
            { score: 0, label: "لا." }
          ]
        },
        {
          code: "Z25",
          name: "استخدام القبضة الملقاطية",
          goalText: "سيتمكن الطفل من التقاط أشياء صغيرة باستخدام قبضة الكماشة الملقاطية.",
          criteria: [
            { score: 1, label: "لم يتقن" },
            { score: 0, label: "لا." }
          ]
        },
        {
          code: "Z26",
          name: "طي قطعة من الورق",
          goalText: "سيتمكن الطفل من مشاهدة شخص يطوي قطعة من الورق ثم يقلده.",
          criteria: [
            { score: 1, label: "لم يتقن" },
            { score: 0, label: "لا." }
          ]
        },
        {
          code: "Z27",
          name: "قص الاشكال",
          goalText: "سيتمكن الطفل من قص الاشكال باستخدام المقص.",
          criteria: [
            { score: 1, label: "لم يتقن" },
            { score: 0, label: "لا." }
          ]
        },
        {
          code: "Z28",
          name: "نقل رسم الاشكال والانماط بدقة",
          goalText: "سيتمكن الطفل من نقل الاشكال والانماط الخطية.",
          criteria: [
            { score: 1, label: "لم يتقن" },
            { score: 0, label: "لا." }
          ]
        }
      ]
    }
  ]
};

